{
    "lastUpdated": "December 2024",
    "terms": [
      {
        "section": "Acceptance of Terms",
        "content": "By using Mayrahkee’s services, you agree to comply with these Terms. If you do not agree with these Terms, you must not access or use the platform."
      },
      {
        "section": "Eligibility",
        "content": "You must be at least 18 years old to use Mayrahkee. By using the platform, you represent that you are of legal age or have the consent of a parent or guardian."
      },
      {
        "section": "User Registration",
        "content": "To use certain features of Mayrahkee, you must create an account. You agree to provide accurate, current, and complete information during the registration process. You are responsible for maintaining the confidentiality of your account and for all activities that occur under your account."
      },
      {
        "section": "Use of the Platform",
        "content": "You agree to use Mayrahkee only for lawful purposes and in accordance with these Terms. You must not engage in activities that:",
        "list": [
          "Violate any applicable laws or regulations.",
          "Infringe on the intellectual property rights of others.",
          "Disrupt or harm the platform’s functionality or security.",
          "Engage in fraudulent activities or mislead others."
        ]
      },
      {
        "section": "Job Recruitment and Course Enrollment",
        "content": "Mayrahkee provides job recruitment services and online courses. Employers may post job listings, and job seekers may apply for positions. You acknowledge that Mayrahkee does not guarantee the success of job applications or employment. For courses, you can enroll in free or paid courses, but Mayrahkee is not responsible for the outcome of course participation or performance."
      },
      {
        "section": "Payment for Paid Services",
        "content": "For paid courses or services, you agree to pay the fees associated with your selected options. Payment is processed through third-party payment processors, and you agree to comply with their terms and conditions. All fees are non-refundable unless otherwise stated."
      },
      {
        "section": "Content and Intellectual Property",
        "content": "The content on Mayrahkee, including text, graphics, logos, images, and software, is protected by copyright, trademark, and other intellectual property laws. You may not copy, distribute, or use any content from the platform without proper authorization."
      },
      {
        "section": "User-Generated Content",
        "content": "You may upload content to Mayrahkee, including job applications, resumes, and course materials. By submitting content, you grant Mayrahkee a non-exclusive, worldwide, royalty-free license to use, display, and distribute that content in connection with the platform. You are solely responsible for the content you submit and ensure it does not infringe on third-party rights or violate any laws."
      },
      {
        "section": "Privacy",
        "content": "Mayrahkee is committed to protecting your privacy. For details on how we collect and use your personal information, please refer to our Privacy Policy."
      },
      {
        "section": "Termination of Access",
        "content": "Mayrahkee reserves the right to suspend or terminate your access to the platform if you violate these Terms. Upon termination, your right to use the platform will cease, and you must stop using all services provided by Mayrahkee."
      },
      {
        "section": "Disclaimers",
        "content": "Mayrahkee does not guarantee the accuracy, reliability, or completeness of the platform’s content. We do not endorse employers, job seekers, or course providers. Your use of the platform is at your own risk, and we make no warranties about the outcomes of job applications or course enrollment."
      },
      {
        "section": "Limitation of Liability",
        "content": "To the fullest extent permitted by law, Mayrahkee and its affiliates are not liable for any indirect, incidental, special, or consequential damages arising from your use of the platform. Our liability is limited to the amount you have paid for the service giving rise to the claim."
      },
      {
        "section": "Indemnification",
        "content": "You agree to indemnify and hold harmless Mayrahkee and its affiliates from any claims, losses, or damages resulting from your violation of these Terms or your use of the platform."
      },
      {
        "section": "Changes to Terms",
        "content": "Mayrahkee may update these Terms from time to time. Any changes will be posted on this page with the updated \"Last Updated\" date. It is your responsibility to review these Terms periodically."
      },
      {
        "section": "Governing Law",
        "content": "These Terms are governed by the laws of the jurisdiction in which Mayrahkee operates. Any disputes arising from these Terms will be resolved in the courts of that jurisdiction."
      },
      {
        "section": "Contact Us",
        "content": "If you have any questions or concerns about these Terms, please contact us at:",
        "contactDetails": {
          "email": "support@mayrahkee.com",
          "address": "6th Floor, NICON Plaza, 242 Muhammadu Buhari Way, Central Business District, Abuja."
        }
      }
    ]
  }
  